修复了设计文档中的一些问题
